БИТУправление_медицинским_центром_демо/src/Catalogs/ДокументыУдостоверяющиеЛичность/ДокументыУдостоверяющиеЛичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыУдостоверяющиеЛичность</name>
  <predefined>
    <items>
      <name>ИМНС14</name>
      <description>Временное удостоверение личности гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС22</name>
      <description>Загранпаспорт гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС91</name>
      <description>Иные документы</description>
    </items>
    <items>
      <name>ИМНС21</name>
      <description>Паспорт гражданина Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС10</name>
      <description>Паспорт иностранного гражданина</description>
    </items>
    <items>
      <name>ИМНС15</name>
      <description>Разрешение на временное проживание в Российской Федерации</description>
    </items>
    <items>
      <name>ИМНС03</name>
      <description>Свидетельство о рождении</description>
    </items>
  </predefined>
  <attributes>
    <name>НеИмеетСерию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаСерииДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовДУЛ</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовДУЛРЭМД</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаКодаПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ДокументыУдостоверяющиеЛичность/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.КлассификаторДокументовУдостоверяющихЛичность));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КлассификаторВидовДУЛ.ПараметрыВыбора = НовыеПараметры;
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ДокументыУдостоверяющиеЛичность));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КлассификаторВидовДУЛРЭМД.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НеИмеетСериюПриИзменении(Элемент)	
	
	Объект.МаскаСерииДокумента = "";
	Элементы.МаскаСерииДокумента.Доступность = Не Объект.НеИмеетСерию;
	
КонецПроцедуры

#КонецОбласти
